# У вас есть три числа, они вводятся из консоли.
# Первое число называется fizz, второе называется buzz.
# До третьего необходимо досчитать от единицы. Считая, надо выводить число.
# Если число кратно fizz - надо выводить F вместо числа. Если число кратно buzz - надо выводить B вместо числа.
# Если число кратно и fizz и buzz, надо выводить FB. И так - пока не будет достигнуто третье введенное число.

fizz = int(input())
buzz - int(input())
number = int(input))
for i in range(1, number+1):
    if ('i % fizz ==0 and buzz ==0'):
        print('FB')
    elif ('i % fizz == 0')
        print ('B')
    elif ('i % buzz ==0')
        print('F')